{
    "pages": [{
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "This is the very first of many adventures of the brave Sir Indie.<br><hr>During this adventure, you decide how you want to approach the problems you face. Choose carefully and get the perfect score..",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "It all happened overnight. The shouting from outside roused you from your sleep. Jumping out of bed you looked out of the window and saw your village being consumed by a fiery inferno as if you had woken up in hell. The heat struck you in the face and smoke was already filling your room, stinging in your eyes.<br><br>People were screaming, everything was on fire and amidst it all stood a giant creature causing death and destruction everywhere. Then you noticed the dragon was climbing the castle and you realized that your lord and his family were in danger!<br><br>While you put on some pants, the creature let out a terrifying roar and a rumbling shook the ground and houses. Again you looked outside, just in time to see the monster grabbing something from the now collapsing tower and taking flight.<br><br>Then the ground opened up beneath your feet and you were swallowed by darkness....",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "",
                    "skip": ""
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Some time later you wake up buried under rubble and ash. With maximum effort, you are able to get out of the stones and broken planks that used to be your home. However, one wall still stands straight as if in defiance of what had happened to your village.<br><br>As you stand in front of the wall watching your trusty weapons you decide that you would right the wrong that was done to your people. You would only need to decide what weapon you would be using for this quest....",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "Choose the crossbow,<br>weapon of Hunters",
                    "item": "Crossbow",
                    "skip": ""
                }],
                "1": [{
                    "text": "Choose the staff,<br>weapon of Mages",
                    "item": "Staff",
                    "skip": ""
                }],
                "2": [{
                    "text": "Choose the sword,<br>weapon of Champions",
                    "item": "Sword",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "With your trusty weapon of choice you now feel ready to embark on your epic quest! Of course, you would first need to find the wretched creature.<br><hr>From the surviving villagers you heard that the dragon kidnapped the princess and flew to the mountains east of the village. Thus you would not only be killing a formidable foe but also get the opportunity to rescue a fair maiden!<br><hr>You also learned that 3 possible roads could lead there.<br><hr>One would travel through the forest, where dangerous creatures are rumored to be stalking through the dense brush.<br><hr>Another road would follow the traders' route through the fields, where one would have to be careful of gangs of bandits and thugs lying in ambush.<br><hr>The last option would be to follow the river where spirits of nature are abundant and best not disturbed.<br><br>Consider carefully the route to travel....",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "Use the forest, you have no fear of wild beasts!",
                    "item": "",
                    "skip": ""
                }],
                "1": [{
                    "text": "Use the traders route, you are not easily surprised!",
                    "item": "",
                    "skip": "2"
                }],
                "2": [{
                    "text": "Use the river, you are friend of spirits & nature!",
                    "item": "",
                    "skip": "4"
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Having chosen your weapon and route you set out bravely in search of the dragon. Before long you arrive at the edge of the forest. The thick brush hinders your movement and the sparse sunlight shining through the canopy makes shadows dance on the forest floor. Traveling deeper into the forest makes you have more difficulty following the road and more than once you have to retrace your steps. During one of these moments, you are investigating the ground below and you see a single paw print of a large forest predator. <br><hr>You then notice that the forest has gone deadly quiet and while you are readying your weapon a dark shape jumps out of the brush. A loud roar rumbles through the forest, transforming into an angry hissing. After a few seconds that changes to silence and the forest becomes quiet once more. Panting, you praise your Luck, as you were able to pull out your sword just in time to see the beast jumping out of the thicket and piercing it on your blade.<br><hr>You can then clearly see the road in front of you, where the beast has created a hole in the brush when it jumped out. You stride forward and find the bones of a less lucky adventurer nearby, still grasping its shield. Seeing as the beast already got them, they probably don't have a need for the shield anymore. You manage to break it free from the bony fingers and take it along on your quest..",
            "requirement": "Sword",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "Shield",
                    "skip": "5"
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Having chosen your weapon and route you set out bravely in search of the dragon. Before long you arrive at the edge of the forest. The thick brush hinders your movement and the sparse sunlight shining through the canopy makes shadows dance on the forest floor. Traveling deeper into the forest makes you have more difficulty following the road and more than once you have to retrace your steps. During one of these moments, you are investigating the ground below and you see a single paw print of a large forest predator. <br><hr>You then notice that the forest has gone deadly quiet and while you are readying your weapon a dark shape jumps out of the brush. A loud roar rumbles through the forest, and the beast jumps on top of you swiping away at you with its claws. You then manage to pull your weapon free and strike the beast. You hear a pained shriek and the creature then flees, leaving you alone and bleeding.<br><hr>You decide it best not to go after the wounded beast because you both are hurt pretty bad. After a while you manage to find another path instead, leading you to the edge of the forest..",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "",
                    "skip": "4"
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Having chosen your weapon and route you set out bravely in search of the dragon. You follow the common road and pass by the occasional farmhouse. The sun shines and it's a beautiful day. Merrily you continue your travels. As the hours go by the landscape around you changes from farms & meadows to hills.<br><hr>Suddenly a bright flash catches your attention at the top of the hill. You stop walking and look in the direction you have seen the flash. However, there seems to be nothing there, except for the large white rocks that can be found here in abundance. You know this region is rumored to be bandit ambush territory, so better safe than sorry. Taking your crossbow you fire a shot as a precaution. As you release the mechanism and the bolt disappears between the stones and you hear a sharp cry of pain. The rocks appear to have been an illusion, which quickly vanishes as you see 2 bandits running away, one with the bolt in his shoulder.<br><hr>You decide to climb up the hill to confirm that they have gone. And indeed, there appears to be no trace of the 2 figures anymore. After doing a quick search you find a lasso that the hurt bandit must have left behind. They won't be needing it anymore, so you decide to take it along on your journey, might as well come in handy..",
            "requirement": "Crossbow",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "Lasso",
                    "skip": "3"
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Having chosen your weapon and route you set out bravely in search of the dragon. You follow the common road and pass by the occasional farmhouse. The sun shines and it's a beautiful day. Merrily you continue your travels. As the hours go by the landscape around you changes from farms & meadows to hills.<br><hr>Suddenly a bright flash catches your attention at the top of the hill. You stop walking and look in the direction you have seen the flash. However, there seems to be nothing there, except for the large white rocks that can be found here in abundance. You know this region is rumored to be bandit ambush territory, so better proceed with caution.<br><hr>As you are getting closer to the top you suddenly hear the sound of a crossbow firing and feel a sharp pain as the bolt scrapes your left shoulder. A lesser man or woman might have fled, but you start running to face your yet unseen foe. Upon brandishing your weapons you can see 2 bandits running away from you. The rocks appear to have been an illusion, which quickly vanishes.<br><hr>You quickly get to the top of the hill and before you you can see more hills with the same white large rocks. You decide it won't be worth to try to find these 2 bandits as they have the advantage of superior range. You return to the road and continue your journey to the dragon's hideout..",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "",
                    "skip": "2"
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Having chosen your weapon and route you set out bravely in search of the dragon. You find the small stream at the edge of town, which you know becomes the roaring river dividing the forests and the hillside. As you keep on venturing further you notice the first signs of nature spirits living nearby.<br><hr>Gradually the sound of the rushing river increases and very soon you can't hear anything else anymore. Magical lights float over the water and small shapes can be seen swimming below. You then come upon a few boulders lying in the river which you can use to traverse the rough waters. You ready a spell and call forth the spirit of the passing, calming it until you have made the crossing.<br><hr>At your command the river transforms into a tranquil tributary, allowing you to jump from one rock to the other. You find yourself already halfway when you see a small amulet floating gently towards you. You pick it up and decide that this might be a gift from the spirit of the river, so you put it around your neck.<br><hr>Without any trouble you make it across and thank the river for your gentle passing. Your words have not all been spoken yet or the waters have gone back to their wild churning from before. You continue your journey in good spirits..",
            "requirement": "Staff",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "Amulet",
                    "skip": "1"
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Having chosen your weapon and route you set out bravely in search of the dragon. You find the small stream at the edge of town, which you know becomes the roaring river dividing the forests and the hillside. As you keep on venturing further you notice the first signs of nature spirits living nearby.<br><hr>Gradually the sound of the rushing river increases and very soon you can't hear anything else anymore. Magical lights float over the water and small shapes can be seen swimming below. You then come upon a few boulders lying in the river which you can use to traverse the rough waters. Your superior athleticism allows you to jump from one rock to the other and find yourself already halfway when you see some magical lights playing by your feet.<br><hr>However when you make the next jump, the playful spirits jump along, bumping into you and causing you to lose your balance. The world shifts and you fall into the cold water, where the powerful flow drags you along, thrashing you about between the boulders. You hit your head against one of these rocks and a sharp ringing fills your ears. The next moment you get pushed onto another boulder and you barely have the strength to climb on top.<br><hr>Still a bit dizzy from the blow you catch your breath and manage to make it to the other side. Bruised and soaked you venture forth to the dragon's den..",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "",
                    "skip": ""
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "After a half-day of traveling the land around becomes more barren and a hint of sulfur can be smelled in the air. This must mean that you are getting closer to the wretched creature's lair. After a short while, you find yourself standing at the foot of the mountain.<br><hr>You search the mountain for any signs of a dragon and your trained adventure eyes spot a few large claw marks in the stones to your east. Climbing up you silently sneak past the abundant rocks and take a look. A large gloomy cave entrance lies ahead of you, a fetid fog obscures the corridor from view. You hold your breath as the smell of sulfur gets overwhelmingly strong here.<br><hr>This must be the home of the dragon, the target of your quest and your sworn enemy since yesterday evening. You have the feeling that there was something else you were supposed to do here as well, but you don't remember and decide to focus on the dragon and the fight that lies ahead..",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "continue",
                    "item": "",
                    "skip": ""
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "With a piece of cloth and some water, you improvise a breathing mask. Taking your last breath of fresh air (at least for a while) you draw your weapon and stride boldly forward into the gaping maw of the dragon's lair.<br><hr>The heavy noxious fumes sting your eyes and make it difficult to breathe. A dim orange glow lights the way ahead. The temperature is rising unwaveringly while you approach this light. With your back against the wall, you bravely peek around the corner.<br><hr>A large cavern stretches out before you, piles of glittering treasure lying everywhere. The heat is almost unbearable here and you soon see the reason why. Bubbling pools of lava are filling the place with their searing heat, occasionally spewing droplets of the red-hot liquid in the air when one of the larger bubbles burst. You make a note to yourself to stay away from these.<br><hr>Near the center of the room you can see a circle of cyclopean pillars, some reaching to the ceiling while others have crumbled. On the remains of one of these perished cylinders, you can see the huge form of the dragon! You freeze momentarily but sigh in relief when you see the monstrosity is sleeping amidst its riches.<br><hr>Now would be a perfect time to strike, if you can decide on the best way to slay this serpent....",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "Climb to the tail, a superiour position will win this fight.",
                    "item": "",
                    "skip": ""
                }],
                "1": [{
                    "text": "Rush the body, better to strike fast & hard.",
                    "item": "",
                    "skip": "2"
                }],
                "2": [{
                    "text": "Sneak to the head, hit the beast where it hurts.",
                    "item": "",
                    "skip": "4"
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Climb to the tail success.",
            "requirement": "Staff",
            "options": [{
                "0": [{
                    "text": "Contine",
                    "item": "",
                    "skip": "5"
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Climb to the tail fail.",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "continue",
                    "item": "",
                    "skip": "4"
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Rush the body success.",
            "requirement": "Sword",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "",
                    "skip": "3"
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Rush the body fail.",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "",
                    "skip": "2"
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Sneak to the head success.",
            "requirement": "Crossbow",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "",
                    "skip": "1"
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Sneak to the head fail.",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "",
                    "skip": ""
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Ready really big attack.",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "Time for foul play, use a trick.",
                    "item": "",
                    "skip": ""
                }],
                "1": [{
                    "text": "Assess the situation and think of a plan.",
                    "item": "",
                    "skip": "2"
                }],
                "2": [{
                    "text": "Brace yourself and stand your ground.",
                    "item": "",
                    "skip": "4"
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Big attack 1 success.",
            "requirement": "Lasso",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "",
                    "skip": "5"
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Big attack 1 fail.",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "",
                    "skip": "4"
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Big attack 2 success.",
            "requirement": "Amulet",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "",
                    "skip": "3"
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Big attack 2 fail.",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "",
                    "skip": "2"
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Big attack 3 success.",
            "requirement": "Shield",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "",
                    "skip": "1"
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Big attack 3 fail.",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "",
                    "skip": ""
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Slaying the dragon+.",
            "requirement": "fullhealth",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "",
                    "skip": "1"
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Slaying the dragon.",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "Continue",
                    "item": "",
                    "skip": "1"
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Return to the village+.",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        },
        {
            "image": "https://i.imgur.com/FVxPOSG.png",
            "text": "Return to the village.",
            "requirement": "",
            "options": [{
                "0": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "1": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }],
                "2": [{
                    "text": "",
                    "item": "",
                    "skip": ""
                }]
            }]
        }
    ]
}